{
  "aboutText": "  I was born in 1998 in Istanbul, Turkey. I started at the university in 2016 in the Software Engineering department. After two years, I couldn't make it due to my health problems. Later I have gotten a bachelor's in Information Management Systems.\n\tI speak Turkish (native), English (advanced), Arabic (elementry), Dutch (elementry). Although I couldn't complete my software engineering bachelor's, I have always wanted to be a software developer. So I kept going little by little in time. Now I put all my effort into being a specialized full-stack developer. I think I am a good fit for this job. I am creative with a practical mind that allows me to approach problems from another perspective. One of my strengths is my competitive side which makes me more determined on a project I work on. The other is that when an error or a problem occurs on the project, I can be 100% concentrated on it until I have figured it out. I remember once I had tried to solve an issue in my code for a nonstop 16 hours.",
  "timeline": [
    {
      "date": "01.2023 - Current",
      "title": "Self Learning MERN Stack ",
      "desc": "I put my all effort and time into learning and developing MERN stack projects since Jan 2023.",
      "details": "•  Node.js, Express.js-REST API, React, MongoDB, Tailwind"
    },
    {
      "date": "08.2021-01.2023",
      "title": "Intern Developer at Maspak Company",
      "desc": "My part-time role was to work on product API, create landing websites and CMS websites, design HTML Newsletter in an exporting company.",
      "details": "• REST API, CMS, HTML, CSS"
    },
    {
      "date": "08.2020-02.2021",
      "title": "Intern Web Developer at Panamera Company",
      "desc": "My part-time role was to make adjustments on a real estate web project.",
      "details": "• PHP, HTML, CSS"
    },
    {
      "date": "10.2019-08.2023",
      "title": "Eskisehir Anadolu University - Information Management Systems",
      "desc": "I have completed my bachelor's degree on Information Management Systems after I quit Software Engineering program.",
      "details": ""
    },
    {
      "date": "09.2016 - 07.2019",
      "title": "Istanbul Sabahattin Zaim University - Software Engineering",
      "desc": "I had to drop out Software Engineering bachelor's program due to my health issues at the end of 4th semester.",
      "details": ""
    }
  ],
  "skills": [
    {
      "skill": "HTML",
      "progress": "90%",
      "classname": "a"
    },
    {
      "skill": "CSS",
      "progress": "70%",
      "classname": "b"
    },
    {
      "skill": "Javascript",
      "progress": "90%",
      "classname": "c"
    },
    {
      "skill": "React.js",
      "progress": "80%",
      "classname": "d"
    },
    {
      "skill": "Node.js - Rest API",
      "progress": "75%",
      "classname": "e"
    },
    {
      "skill": "Tailwind CSS",
      "progress": "75%",
      "classname": "f"
    },
    {
      "skill": "Mongo DB",
      "progress": "65%",
      "classname": "g"
    },
    {
      "skill": "PHP",
      "progress": "65%",
      "classname": "h"
    },
    {
      "skill": "JQUERY",
      "progress": "70%",
      "classname": "i"
    },
    {
      "skill": "Adobe Photoshop",
      "progress": "85%",
      "classname": "j"
    }
  ]
}
